<template>
  <div class="detail">
    <header>
      <div class="header-return" v-show="isShow">
        <svg t="1672756953667" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2660" width="24" height="24"><path d="M512.105912 80.83812c-237.365082 0-429.779394 192.56883-429.779394 430.134481 0 237.564627 192.414311 430.132434 429.779394 430.132434 237.387595 0 429.801906-192.567807 429.801906-430.132434C941.907818 273.40695 749.494531 80.83812 512.105912 80.83812zM605.570607 696.710862c10.212596 10.166547 11.227716 25.591865 2.321882 34.477232-8.92937 8.885368-24.465205 7.844665-34.675754-2.297322l-199.88547-197.651592c-5.79089-5.7694-8.53028-13.19451-8.266267-20.180622-0.309038-7.048533 2.432399-14.541181 8.245801-20.35356l199.905936-197.651592c10.210549-10.166547 25.724895-11.183713 34.675754-2.298346 8.905834 8.884344 7.891737 24.311709-2.321882 34.477232L417.64554 510.972601 605.570607 696.710862z" fill="#fff" p-id="2661"></path></svg>
        <svg t="1672757038015" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3990" width="24" height="24"><path d="M1012.646039 459.30735 535.153 8.876259c-10.824779-11.426156-28.264701-12.027532-39.690857-0.601377L12.556714 458.104597c-7.216519 6.013766-12.027532 16.237169-12.027532 27.663325 0 19.244052 13.831662 34.278468 30.670208 34.278468l108.849169 0 0 354.812208c0 40.89361 15.034416 78.178961 39.089481 105.240909 24.055065 27.061948 57.130779 43.900494 93.814753 43.900494l117.268442 0 0-144.33039 0-272.423611c0-10.824779 4.209636-21.048182 10.223403-28.264701 6.615143-7.216519 15.635792-12.027532 25.257818-12.027532l174.399221 0c9.622026 0 18.642675 4.811013 25.257818 12.027532 6.615143 7.216519 10.223403 17.439922 10.223403 28.264701l0 416.754 159.966182 0 3.60826 0 4.209636 0c22.250935 0 42.69774-10.223403 57.732156-27.061948 15.034416-16.838545 24.055065-39.690857 24.055065-64.948675L885.154195 520.046389 992.800611 520.046389l0 0c9.020649 0 17.439922-4.209636 23.453688-12.027532C1027.079078 492.984441 1025.274949 471.334883 1012.646039 459.30735zM178.536662 452.692207l1.202753 0 0 0.601377C179.739415 453.293584 179.138039 453.293584 178.536662 452.692207z" p-id="3991" fill="#fff"></path></svg>
      </div>
      <div class="header-bar" v-show="!isShow" :style="styleOption">
        <div>
          <svg t="1672756953667" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2660" width="24" height="24"><path d="M512.105912 80.83812c-237.365082 0-429.779394 192.56883-429.779394 430.134481 0 237.564627 192.414311 430.132434 429.779394 430.132434 237.387595 0 429.801906-192.567807 429.801906-430.132434C941.907818 273.40695 749.494531 80.83812 512.105912 80.83812zM605.570607 696.710862c10.212596 10.166547 11.227716 25.591865 2.321882 34.477232-8.92937 8.885368-24.465205 7.844665-34.675754-2.297322l-199.88547-197.651592c-5.79089-5.7694-8.53028-13.19451-8.266267-20.180622-0.309038-7.048533 2.432399-14.541181 8.245801-20.35356l199.905936-197.651592c10.210549-10.166547 25.724895-11.183713 34.675754-2.298346 8.905834 8.884344 7.891737 24.311709-2.321882 34.477232L417.64554 510.972601 605.570607 696.710862z" fill="#fff" p-id="2661"></path></svg>
        </div>
        <div>
          <span>商品详情</span>
          <span>商品评价</span>
        </div>
        <div>
          <svg t="1672757038015" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3990" width="24" height="24"><path d="M1012.646039 459.30735 535.153 8.876259c-10.824779-11.426156-28.264701-12.027532-39.690857-0.601377L12.556714 458.104597c-7.216519 6.013766-12.027532 16.237169-12.027532 27.663325 0 19.244052 13.831662 34.278468 30.670208 34.278468l108.849169 0 0 354.812208c0 40.89361 15.034416 78.178961 39.089481 105.240909 24.055065 27.061948 57.130779 43.900494 93.814753 43.900494l117.268442 0 0-144.33039 0-272.423611c0-10.824779 4.209636-21.048182 10.223403-28.264701 6.615143-7.216519 15.635792-12.027532 25.257818-12.027532l174.399221 0c9.622026 0 18.642675 4.811013 25.257818 12.027532 6.615143 7.216519 10.223403 17.439922 10.223403 28.264701l0 416.754 159.966182 0 3.60826 0 4.209636 0c22.250935 0 42.69774-10.223403 57.732156-27.061948 15.034416-16.838545 24.055065-39.690857 24.055065-64.948675L885.154195 520.046389 992.800611 520.046389l0 0c9.020649 0 17.439922-4.209636 23.453688-12.027532C1027.079078 492.984441 1025.274949 471.334883 1012.646039 459.30735zM178.536662 452.692207l1.202753 0 0 0.601377C179.739415 453.293584 179.138039 453.293584 178.536662 452.692207z" p-id="3991" fill="#fff"></path></svg>
        </div>
      </div>
    </header>
    <section ref="wrapper">
      <div>
        <div class="swiper-main">
          <swiper :options = "swiperOption" class="">
            <swiper-slide
            v-for="(item,index) in swiperList"
            :key="index">
              <img :src="item.imgUrl">
            </swiper-slide>
          </swiper>
      <div class="swiper-pagination" id="dots"></div>
        </div>
        <div class="goods-container">
          <div class="goods_name">
            <h1>2022波奇酱 - 美少女 珍稀美少女1号</h1>
            <div>性价首选，美感十足，可可爱爱的大众美少女</div>
          </div>
          <div class="goods_price">
            <div class="oprice">
              <span>￥</span>
              <b>88</b>
            </div>
            <div class="pprice">
              <span>价格:</span>
              <del>￥239</del>
            </div>
          </div>
        </div>
        <div class="tianchong">
          <div><img src='static/images/Detail/1.jpg'></div>
          <div><img src='static/images/Detail/2.jpg'></div>
          <div><img src='static/images/Detail/3.jpg'></div>
        </div>
      </div>
    </section>
    <footer>
      <ul>
        <li>
          <svg t="1672223755019" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2714" width="24" height="24"><path d="M927.616 465.6C923.328 236.704 745.888 51.808 528 51.808h-32c-217.888 0-395.328 184.896-399.616 413.76C58.112 487.744 32 528.672 32 576v64c0 70.592 57.408 128 128 128s128-57.408 128-128v-64a128.064 128.064 0 0 0-126.784-127.872C173.728 262.688 318.912 115.808 496 115.808h32c177.12 0 322.272 146.88 334.784 332.32A128.064 128.064 0 0 0 736 576v64c0 57.792 38.72 106.176 91.392 122.016a337.504 337.504 0 0 1-191.936 124.48A79.712 79.712 0 0 0 560 832a80 80 0 1 0 0 160 79.68 79.68 0 0 0 67.872-38.112 402.432 402.432 0 0 0 278.24-193.6C955.968 742.816 992 695.776 992 640v-64c0-47.328-26.112-88.256-64.384-110.4zM224 576v64c0 35.296-28.704 64-64 64s-64-28.704-64-64v-64c0-35.296 28.704-64 64-64s64 28.704 64 64z m704 64c0 34.304-27.2 62.176-61.12 63.712l-2.496-1.184c-0.224 0.512-0.576 0.928-0.8 1.408A64 64 0 0 1 800 640v-64c0-35.296 28.704-64 64-64s64 28.704 64 64v64z" p-id="2715"></path></svg>
          <span>客服</span>
        </li>
        <li>
          <svg t="1672223821144" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3888" width="24" height="24"><path d="M848 712H318.4c-25.6 0-46.4-19.2-48-41.6L240 201.6c-1.6-25.6-16-46.4-38.4-57.6l-48-20.8c-12.8-4.8-25.6 0-32 12.8s0 25.6 12.8 32l46.4 20.8c6.4 3.2 11.2 9.6 11.2 17.6l28.8 468.8c3.2 48 46.4 86.4 96 86.4H848c12.8 0 24-11.2 24-24s-11.2-25.6-24-25.6z" p-id="3889"></path><path d="M884.8 265.6c-14.4-16-35.2-25.6-57.6-25.6H337.6c-12.8 0-24 11.2-24 24s11.2 24 24 24h489.6c8 0 16 3.2 20.8 9.6 4.8 6.4 8 14.4 8 22.4l-38.4 211.2v1.6c-1.6 14.4-12.8 24-27.2 25.6l-420.8 32c-12.8 1.6-22.4 12.8-22.4 25.6 1.6 12.8 11.2 22.4 24 22.4h1.6l419.2-32c36.8-3.2 67.2-30.4 70.4-67.2l38.4-212.8v-1.6c4.8-20.8-1.6-43.2-16-59.2z" p-id="3890"></path><path d="M305.6 856m-56 0a56 56 0 1 0 112 0 56 56 0 1 0-112 0Z" p-id="3891"></path><path d="M753.6 856m-56 0a56 56 0 1 0 112 0 56 56 0 1 0-112 0Z" p-id="3892"></path></svg>
          <span>购物车</span>
        </li>
        <li>
          <svg t="1672225651429" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4857" width="24" height="24"><path d="M335.008 916.629333c-35.914667 22.314667-82.88 10.773333-104.693333-25.557333a77.333333 77.333333 0 0 1-8.96-57.429333l46.485333-198.24a13.141333 13.141333 0 0 0-4.021333-12.864l-152.16-132.586667c-31.605333-27.52-35.253333-75.648-8.234667-107.733333a75.68 75.68 0 0 1 51.733333-26.752L354.848 339.2c4.352-0.362667 8.245333-3.232 10.026667-7.594667l76.938666-188.170666c16.032-39.2 60.618667-57.92 99.52-41.461334a76.309333 76.309333 0 0 1 40.832 41.461334l76.938667 188.16c1.781333 4.373333 5.674667 7.253333 10.026667 7.605333l199.712 16.277333c41.877333 3.413333 72.885333 40.458667 69.568 82.517334a76.938667 76.938667 0 0 1-26.08 51.978666l-152.16 132.586667c-3.541333 3.082667-5.141333 8.074667-4.021334 12.853333l46.485334 198.24c9.621333 41.013333-15.36 82.336-56.138667 92.224a75.285333 75.285333 0 0 1-57.525333-9.237333l-170.976-106.24a11.296 11.296 0 0 0-12.010667 0l-170.986667 106.24zM551.786667 756.032l170.976 106.24c2.624 1.621333 5.717333 2.122667 8.650666 1.408 6.410667-1.557333 10.56-8.426667 8.928-15.424l-46.485333-198.24a77.141333 77.141333 0 0 1 24.277333-75.733333L870.293333 441.706667c2.485333-2.165333 4.053333-5.312 4.330667-8.746667 0.565333-7.136-4.490667-13.173333-10.976-13.696l-199.712-16.288a75.989333 75.989333 0 0 1-64.064-47.168l-76.938667-188.16a12.309333 12.309333 0 0 0-6.538666-6.741333c-5.898667-2.496-12.725333 0.373333-15.328 6.741333l-76.949334 188.16a75.989333 75.989333 0 0 1-64.064 47.168l-199.701333 16.288a11.68 11.68 0 0 0-7.978667 4.181333 13.226667 13.226667 0 0 0 1.333334 18.261334l152.16 132.586666a77.141333 77.141333 0 0 1 24.277333 75.733334l-46.485333 198.229333a13.333333 13.333333 0 0 0 1.514666 9.877333c3.488 5.792 10.581333 7.530667 16.064 4.128l170.986667-106.229333a75.296 75.296 0 0 1 79.562667 0z" fill="#000000" p-id="4858"></path></svg>
          <span>收藏</span>
        </li>
        <li>加入购物车</li>
        <li>立即购买</li>
      </ul>
    </footer>
  </div>
</template>

<script>
import 'Swiper/dist/css/swiper.css'
import { swiper, swiperSlide } from 'vue-awesome-swiper'
import BScroll from '@better-scroll/core'
export default {
  name: 'Detail',
  components: {
    swiper,
    swiperSlide
  },
  data () {
    return {
      isShow: true,
      bs: '',
      styleOption: {},
      swiperOption: {
        autoplay: 3000,
        speed: 1000,
        pagination: {
          el: '.swiper-pagination',
          clickable: true,
          type: 'fraction'
        }
      },
      swiperList: [
        {
          imgUrl: 'static/images/Detail/1.jpg'
        },
        {
          imgUrl: 'static/images/Detail/2.jpg'
        },
        {
          imgUrl: 'static/images/Detail/3.jpg'
        }
      ]
    }
  },
  mounted () {
    this.$nextTick(() => {
      this.bs = new BScroll(this.$refs.wrapper, { // eslint-disable-line no-unused-vars
        movable: true,
        zoom: true,
        click: true,
        probeType: 3,
        bounce: false
      })
      this.bs.on('scroll', (pos) => {
        // console.log(pos.y)
        let posY = Math.abs(pos.y)
        let opcity = posY / 220
        opcity = opcity > 1 ? 1 : opcity
        this.styleOption = {
          opacity: opcity
        }
        this.isShow = !(posY >= 100)
      })
    })
  }
}
</script>

<style lang="less" scoped>
.detail{
  width: 100%;
  height: 100vh;
  display: flex;
  flex-direction: column;
  overflow: hidden;
  section{
    flex: 1;
    overflow: hidden;
  }
  header {
    position: fixed;
    width: 100%;
    left: 0px;
    top: 0px;
    height: 1.17rem;
    z-index: 999;
    .header-return,
    .header-bar
    {
      display: flex;
      width: 100%;
      align-items: center;
      height: 1.17rem;
      justify-content: space-between;
      svg {
        margin: 5px 10px;
        padding: 6px;
        border-radius: 50%;
        background-color: rgba(0,0,0,0.3);
      }
    }
    .header-bar{
      background-color: #fff;
      font-size: 0.4857rem;
      span{
        padding: 0 0.2857rem;
      }
    }
  }
  .swiper-main{
  width: 100%;
  height: 12rem;
  position: relative;
  overflow: hidden;
  .swiper-container{
    width: 100%;
    height: 12rem !important;
    overflow: hidden !important;
    position: relative;
    // background-color: red;
    img{
    width: 100%;
    overflow: hidden;
    // height: 14rem;
  }
  }
  .swiper-pagination#dots{
    position: absolute;
    height: 20px;
    line-height: 20px;
    // right: 0px !important;
    left: 85%;
    bottom: 10px;
    font-size: 0.4571rem;
    color: #fff;
    width: 50px;
    background-color: rgba(0,0,0,0.5);
    // background-color: red;
  }
  }
  .goods-container{
    .goods_name{
      padding: 0.5714rem 0.2rem;
      padding-bottom: 0.2286rem;
      color: #999;
      border-bottom: 1px #ccc solid;
      h1{
        font-size: 0.5429rem;
        font-weight: 600;
        color: black;
      }
      div{
        font-size: 0.4rem;
        padding: 0.1057rem 0;
      }
    }
    .goods_price{
      padding: 0.2286rem 0.2rem;
      // padding-bottom: 0.2286rem;
      .oprice{
        color: red;
        span{
          font-size: 0.3429rem;
        }
        b{
          font-size: 0.5143rem;
          margin-left: -0.1429rem;
        }
      }
      .pprice{
        color: #999;
        font-size: 0.4rem;
        del{
          margin-left: -0.1429rem;
        }
      }
    }
  }
  .tianchong{
    div{
      width: 100%;
      height: 14.2857rem;
      overflow: hidden;
      img{
        width: 100%;
      }
    }
  }
  footer{
    width: 100%;
    position: fixed;
    bottom: 0;
    left: 0;
    height:1.2857rem;
    border-top: 1px solid #ccc;
    ul{
      display: flex;
      align-items: center;
      justify-content: space-between;
      height: 1.2857rem;
      li{
        display: flex;
        flex-direction: column;
        align-items: center;
        justify-content: space-around;
        height: 1.1429rem;
        // background-color: red;
        width: 13%;
        &:nth-child(4){
          width: 30%;
          color: #fff;
          font-size: 0.4571rem;
          background-color: rgb(255, 123, 0);
        }
        &:nth-child(5){
          background-color: rgb(240, 71, 71);
          color: #fff;
          font-size: 0.4571rem;
          width: 30%;
        }
      }
    }
  }
}
</style>
